[Demo_Tutorial_Destiny_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[2]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[3]=(Actor=TUT_TEXTURE,Command=START,CId=5,Bit=0)
DemoScripts[4]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Usual_Ekoro.GG2_BGM_DM_Usual_Ekoro_Cue')
DemoScripts[5]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[6]=(Actor=FADE,Command=WAIT)
DemoScripts[7]=(Actor=WINDOW,Command=SET)
DemoScripts[8]=(Actor=SYSTEM,Command=TAG,Label=JUMP01)
DemoScripts[9]=(Actor=TUT_TEXTURE,Command=SET,CId=1,Bit=1)
DemoScripts[10]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[15]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=2,Bit=2)
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[19]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=3,Bit=3)
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[24]=(Actor=SELECT,Command=SET,ID=SELECT00)
DemoScripts[25]=(Actor=SYSTEM,Command=TAG,Label=JUMP02)
DemoScripts[26]=(Actor=WINDOW,Command=EXIT)
DemoScripts[27]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[28]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[29]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[30]=(Actor=SYSTEM,Command=END)

[Select_Tutorial_Destiny_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=2,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Tutorial_Destiny_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="好了,峯大大人,去尋找命運的女朋友吧!/n......咦? 你問我怎麼做嗎?/n受不了,真拿你沒辦法耶.")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="我這個菁英天使會親自指導你,/n不過是一兩個女朋友,/n就請你趕快找到吧.")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="首先在據點選單中/n應該增加了確認契合度的項目.")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="選擇這個項目後,峯大大人與女朋友候補的/n女孩子之間的契合度就會以列表方式顯示.")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="要特別注意的是命運度的量值./n只有這個量值到達100%的女孩子/n纔是峯大大人命運的對象!")

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="命運度會在各種情況下增減./n所以說,光是和對方相遇/n或是用費洛蒙射擊命中還不夠......")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="最容易提升命運度的/n果然還是心跳模式吧.")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="選擇關卡的時候,/n別忘了要選擇視為目標的女孩子/n有可能出現的地方.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="女孩子們有著各自/n喜歡的男性類型.")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="峯大大人的智力,體能,風格,好色等/n各項參數如果能符合她們喜好的話,/n命運度應該也會更容易上升才對.")

Texts[10]=(Label="TEXT11",Name="艾可蘿",Text="反過來說,如果是完全相反的參數/n命運度就會一動也不動了./n請隨時注意契合度的圖示.")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="好了,在傍晚的時限前/n找出命運度MAX的/n理想的女朋友吧!")

Texts[12]=(Label="",Name="",Text="")

Texts[13]=(Label="SELECT01",Name="",Text="重來一次")

Texts[14]=(Label="SELECT02",Name="",Text="沒問題了")

Texts[15]=(Label="SELECT03",Name="",Text="")

Texts[16]=(Label="SELECT04",Name="",Text="")

Texts[17]=(Label="SELECT05",Name="",Text="")

Texts[18]=(Label="SELECT06",Name="",Text="")

Texts[19]=(Label="SELECT07",Name="",Text="")

Texts[20]=(Label="SELECT08",Name="",Text="")

Texts[21]=(Label="SELECT09",Name="",Text="")

Texts[22]=(Label="SELECT10",Name="",Text="")


